Revit 2026 API

# MassLevelDataMaterialType Property

---

Indicates if the material used for the graphical appearance is by category or a specific material, or if the material to be used should be taken from the ConceptualConstructionType of the MassLevelData.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MassSurfaceDataMaterialType MaterialType { get; set; }
```
```vb
Public Property MaterialType As MassSurfaceDataMaterialType
	Get
	Set
```
```cpp
public:
property MassSurfaceDataMaterialType MaterialType {
	MassSurfaceDataMaterialType get ();
	void set (MassSurfaceDataMaterialType value);
}
```
```fsharp
member MaterialType : MassSurfaceDataMaterialType with get, set
```

#### Property Value

MassSurfaceDataMaterialType

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The material type does not fall within an appropriate range. |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

MassLevelData Class

Autodesk.Revit.DB.Analysis Namespace